package main

// Проверка индексации и не только git status
// Шаг 1
// Я создаю меняю или удоляю фаил
// Шаг 2
// Я индексирую изменения нажимаю + или в терменале пишу git add
// пример git add .\chapter\chapter3.go
// Шаг 3
// Создаю коммит commit можно на прожать коммит в ВСКоде или в терменале написать git commit -m "название commit"
// пример git commit -m "chapten3"
// Шаг 4
// Публикую commit (Пуш[Запушил{значит залил}]) в ВСКоде это круговые стрелочки в левой нижней части экранна,
// а терменале это git push название репозитория (по умолчанию origin) наэвание ветки (главная master)
// пример git push origin master
